Project/Toir/src/DataProcessors/ВосстановлениеНаследованияСтрокТЧ/ВосстановлениеНаследованияСтрокТЧ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВосстановлениеНаследованияСтрокТЧ</name>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/МножественныеЗначенияАтрибутов/МножественныеЗначенияАтрибутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МножественныеЗначенияАтрибутов</name>
  <resources>
    <name>ДоступноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуемоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТабличныйАтрибут</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Класс</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      <types>CatalogRef.НаборыАтрибутов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеАтрибутаКласса</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.ВариантыЗначенийАтрибутовКласса</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/ВосстановлениеНаследованияСтрокТЧ/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыДляВосстановления

&НаКлиенте
Процедура ОбъектыДляВосстановленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = ОбъектыДляВосстановления.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Поле = Элементы.ОбъектыДляВосстановленияОбъект Тогда
		ОткрытьЗначение(ТекСтрока.Объект);
	ИначеЕсли Поле = Элементы.ОбъектыДляВосстановленияРодитель Тогда
		ОткрытьЗначение(ТекСтрока.РодительТекущий);
	ИначеЕсли Поле = Элементы.ОбъектыДляВосстановленияРодительУстановить Тогда
		ОткрытьЗначение(ТекСтрока.РодительУстановить);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДляВосстановленияВыбраноПриИзменении(Элемент)
	ТекИД = Элементы.ОбъектыДляВосстановления.ТекущаяСтрока;
	Если ТекИД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = ОбъектыДляВосстановления.НайтиПоИдентификатору(ТекИД);
	УстановитьФлажокДляПодчиненных(ТекСтрока, ТекСтрока.Выбрано);
	УстановитьФлажокДляРодителей(ТекСтрока, ТекСтрока.Выбрано);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДляВосстановленияПриАктивизацииСтроки(Элемент)
	ОбъектыДляВосстановленияПриАктивизацииСтрокиНаСервере();
КонецПроцедуры // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиОбъектыДляВосстановления(Команда)
	
	НайтиОбъектыДляВосстановленияНаСервере();
	Элементы.ФормаНайтиОбъектыДляВосстановления.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСтрокиДубли(Команда)
	НайтиСтрокиДублиНаСервере();
	Элементы.ФормаУдалитьДублиСтрок.КнопкаПоУмолчанию = Истина;
КонецПроцедуры // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

&НаКлиенте
Процедура ВосстановитьНаследованиеСтрокТЧ(Команда)
	
	ВосстановитьНаследованиеСтрокТЧНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДублиСтрок(Команда)
	УдалитьДублиСтрокНаСервере();
КонецПроцедуры // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

&НаКлиенте
Процедура ВывестиПодчиненныеОбъекты(Команда)
	ВывестиПодчиненныеОбъектыНаСервере();
КонецПроцедуры // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнтерфейсныеПроцедуры

&НаКлиенте
Процедура УстановитьФлажокДляПодчиненных(Строка, Значение)
	
	Строка.Выбрано = Значение;
	ВложенныеСтроки = Строка.ПолучитьЭлементы();
	Для Каждого ВложеннаяСтрока Из ВложенныеСтроки Цикл
		УстановитьФлажокДляПодчиненных(ВложеннаяСтрока, Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажокДляРодителей(Строка, Значение)
	
	СтрокаРодитель = Строка.ПолучитьРодителя();
	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НужноУстановитьЗначениеРодителя = Истина;
	Если Значение = Ложь Тогда
		ЭлементыРодителя = СтрокаРодитель.ПолучитьЭлементы();
		Для Каждого СтрокаВложенная ИЗ ЭлементыРодителя Цикл
			Если НЕ СтрокаВложенная.Выбрано = Значение Тогда
				НужноУстановитьЗначениеРодителя = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НужноУстановитьЗначениеРодителя Тогда 
		Если НЕ СтрокаРодитель.Выбрано = Значение Тогда
			СтрокаРодитель.Выбрано = Значение;
			УстановитьФлажокДляРодителей(СтрокаРодитель, Значение);
		КонецЕсли;
	КонецЕсли;
		
	
КонецПроцедуры

&НаСервере
Процедура ОбъектыДляВосстановленияПриАктивизацииСтрокиНаСервере()
	
	ИДСтроки = Элементы.ОбъектыДляВосстановления.ТекущаяСтрока;
	Если ИДСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = ОбъектыДляВосстановления.НайтиПоИдентификатору(ИДСтроки);
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекРодитель = ТекСтрока.РодительТекущий;
	
	Если ТипЗнч(ТекСтрока.Объект) = Тип("СправочникСсылка.Классы") Тогда
		ТекСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(ТекСтрока.Объект);
		ТаблицаАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТекСписокРодителей);
		ЗначенияАтрибутовКласса.Загрузить(ТаблицаАтрибутов);
		
	ИначеЕсли ТипЗнч(ТекСтрока.Объект) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
		ТаблицаАтрибутов = Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(ТекСтрока.Объект);
		ЗначенияАтрибутовКласса.Загрузить(ТаблицаАтрибутов);
		
	Иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

#КонецОбласти

#Область ПоискОбъектовДляВосстановления

&НаСервере
Процедура НайтиОбъектыДляВосстановленияНаСервере()
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	// 1. Все объекты, у которых есть строки таб.частей.
	Запрос.Текст = ТектЗапросаВсеСтрокиТЧ();
	Результаты = Запрос.ВыполнитьПакет();
	
	МассивОбъектов = Результаты[2].Выгрузить().ВыгрузитьКолонку("Объект");
	
	// 2. Получение строк ТЧ, для которых нужно установить нового родителя.
	Справочники.Классы.ПолучитьОбъектыВосстановленияНаследованияТЧ(МассивОбъектов, МенеджерВТ);
	
	Запрос.Текст = ТекстЗапросаВыборОбъектовДляВосстановления();
	Результаты = Запрос.ВыполнитьПакет();
	
	// 3. Поиск недостающих строк для построения иерархии (если на этапе 2 найдены строки вложенных таб.частей).
	Запрос.Текст = ТектЗапросаОбходСтрокВложенныхТабЧастей();
	
	ВыборкаСтрокиДляПоискаКорневогоОбъекта = Результаты[Результаты.ВГраница()].Выбрать();
	Пока ВыборкаСтрокиДляПоискаКорневогоОбъекта.Следующий() И ВыборкаСтрокиДляПоискаКорневогоОбъекта.Количество > 0 Цикл
		Результаты = Запрос.ВыполнитьПакет();
		ВыборкаСтрокиДляПоискаКорневогоОбъекта = Результаты[2].Выбрать();
	КонецЦикла;
	
	// 4. Таблица классов-родителей для построения иерархии объектов-владельцев таб.частей.
	Запрос.Текст = ТектЗапросаТаблицаРодителей();
	
	ТаблицаРодителей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ОбработатьТаблицуРодителей(ТаблицаРодителей);
	
	// 5. Таблица иерархии классов с отбором по первому уровню ветвления 
	//    (отброс уровней иерархии, в которых только один вложенный элемент).
	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителей);
	Запрос.Текст = ТектЗапросаДанныеДляПостроенияДерева();
	
	Результат = Запрос.Выполнить().Выбрать();
	
	СоответствиеЭлементовДерева = Новый Соответствие;
	СформироватьДеревоКлассов(Результат, СоответствиеЭлементовДерева);
	
	// 6. Таблица номенклатуры для добавления в дерево классов.
	Запрос.Текст = ТектЗапросаНоменклатураДляДобавленияВДерево();
	
	Результат = Запрос.Выполнить().Выбрать();
	ДобавитьВДеревоЭлементыВыборки(Результат, СоответствиеЭлементовДерева);
	
	// 7. Добавление таб.частей и строк в дерево.
	Запрос.Текст = ТектЗапросаВыборСтрокТЧДляДобавления();
	ВыборкаВТСтрокиДляДобавления = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст = ТектЗапросаВыборПодстрокДляДобавления();
	
	СтрокиТЧ = Новый Массив;
	
	Пока ВыборкаВТСтрокиДляДобавления.Следующий() И ВыборкаВТСтрокиДляДобавления.Количество > 0 Цикл
		
		Результаты = Запрос.ВыполнитьПакет();
		ВыборкаСтрокиДляДобавления = Результаты[0].Выбрать();
		ДобавитьВДеревоСтрокиТЧ(ВыборкаСтрокиДляДобавления, СоответствиеЭлементовДерева, СтрокиТЧ);
		
		ВыборкаВТСтрокиДляДобавления = Результаты[3].Выбрать();
	КонецЦикла;
	
	// 8. Отметка строк, у которых нужно поменять родителя.
	ВыполнитьПоискСтрокДляВосстановления(СтрокиТЧ, СоответствиеЭлементовДерева);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТектЗапросаВсеСтрокиТЧ()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СпрНоменклатураКласса.Ссылка КАК Объект
		|ПОМЕСТИТЬ ВТ_НоменклатураСХвостами
		|ИЗ
		|	Справочник.НоменклатураКласса КАК СпрНоменклатураКласса
		|ГДЕ
		|	НЕ СпрНоменклатураКласса.ЭтоГруппа
		|	И СпрНоменклатураКласса.Класс.КлассТабличнаяЧасть
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СпрКлассы.Ссылка КАК Объект
		|ПОМЕСТИТЬ ВТ_КлассыСХвостами
		|ИЗ
		|	Справочник.Классы КАК СпрКлассы
		|ГДЕ
		|	СпрКлассы.КлассТабличнаяЧасть
		|	И СпрКлассы.Родитель.КлассТабличнаяЧасть
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МножественныеЗначенияАтрибутов.Класс КАК Объект
		|ИЗ
		|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКласса КАК СпрНоменклатураКласса
		|		ПО МножественныеЗначенияАтрибутов.Класс = СпрНоменклатураКласса.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассы
		|		ПО МножественныеЗначенияАтрибутов.Класс = СпрКлассы.Ссылка
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса В
		|			(ВЫБРАТЬ
		|				ВТ_НоменклатураСХвостами.Объект
		|			ИЗ
		|				ВТ_НоменклатураСХвостами КАК ВТ_НоменклатураСХвостами
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ
		|				ВТ_КлассыСХвостами.Объект
		|			ИЗ
		|				ВТ_КлассыСХвостами КАК ВТ_КлассыСХвостами)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НоменклатураСХвостами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_КлассыСХвостами";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаВыборОбъектовДляВосстановления()
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_НовыеРодители.Класс КАК Объект,
		|	ЕСТЬNULL(СпрКлассы.КлассТабличнаяЧасть, СпрНоменклатураКласса.Класс.КлассТабличнаяЧасть) КАК СтрокаВложеннойТЧ,
		|	ВЫБОР
		|		КОГДА НЕ СпрКлассы.Ссылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОбъектЭтоКласс,
		|	ВТ_НовыеРодители.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_НовыеРодители.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВТ_НовыеРодители.Порядок КАК Порядок,
		|	ИСТИНА КАК ЕстьСтрокиДляВосстановления,
		|	1 КАК ВидОшибки,
		|	""Ошибка наследования"" КАК ПредставлениеОшибки
		|ПОМЕСТИТЬ ВТ_СтрокиСХвостами
		|ИЗ
		|	ВТ_НовыеРодители КАК ВТ_НовыеРодители
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКласса КАК СпрНоменклатураКласса
		|		ПО ВТ_НовыеРодители.Класс = СпрНоменклатураКласса.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассы
		|		ПО ВТ_НовыеРодители.Класс = СпрКлассы.Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии,
		|	СпрКлассы.КлассТабличнаяЧасть,
		|	ИСТИНА,
		|	ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса,
		|	ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиДляОбработки.Порядок,
		|	ЛОЖЬ,
		|	0,
		|	""""
		|ИЗ
		|	ВТ_НовыеРодители КАК ВТ_НовыеРодители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДляПоискаВИерархии КАК ВТ_ДанныеДляПоискаВИерархии
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|			ПО ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_СтрокиДляОбработки.Класс
		|				И ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса = ВТ_СтрокиДляОбработки.АтрибутКласса
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассы
		|			ПО ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = СпрКлассы.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НовыеРодители КАК ВТ_НайденныеРодители
		|			ПО ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_НайденныеРодители.ЗначениеАтрибутаКласса
		|		ПО ВТ_НовыеРодители.Класс = ВТ_ДанныеДляПоискаВИерархии.Класс
		|			И ВТ_НовыеРодители.АтрибутКласса = ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса
		|			И ВТ_НовыеРодители.ЗначениеАтрибутаКласса = ВТ_ДанныеДляПоискаВИерархии.ЗначениеАтрибутаКласса
		|ГДЕ 
		|	(НЕ СпрКлассы.КлассТабличнаяЧасть ИЛИ НЕ ВТ_НайденныеРодители.ЗначениеАтрибутаКласса ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СтрокиСХвостами.Объект
		|ПОМЕСТИТЬ ВТ_СтрокиДляПоискаКорневогоОбъекта
		|ИЗ
		|	ВТ_СтрокиСХвостами КАК ВТ_СтрокиСХвостами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтрокиСХвостами КАК ВТ_НайденныеРодители
		|		ПО ВТ_СтрокиСХвостами.Объект = ВТ_НайденныеРодители.ЗначениеАтрибутаКласса
		|ГДЕ
		|	ВТ_СтрокиСХвостами.СтрокаВложеннойТЧ
		|	И ВТ_НайденныеРодители.Объект ЕСТЬ NULL";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТектЗапросаОбходСтрокВложенныхТабЧастей()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	МножественныеЗначенияАтрибутов.Класс КАК Объект,
		|	ЕСТЬNULL(СпрКлассы.КлассТабличнаяЧасть, СпрНоменклатураКласса.Класс.КлассТабличнаяЧасть) КАК СтрокаВложеннойТЧ,
		|	ВЫБОР
		|		КОГДА НЕ СпрКлассы.Ссылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОбъектЭтоКласс,
		|	МножественныеЗначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	МножественныеЗначенияАтрибутов.Порядок КАК Порядок
		|ПОМЕСТИТЬ ВТ_СтрокиСХвостамиДобавить
		|ИЗ
		|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКласса КАК СпрНоменклатураКласса
		|		ПО МножественныеЗначенияАтрибутов.Класс = СпрНоменклатураКласса.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассы
		|		ПО МножественныеЗначенияАтрибутов.Класс = СпрКлассы.Ссылка
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса В
		|			(ВЫБРАТЬ
		|				ВТ_СтрокиДляПоискаКорневогоОбъекта.Объект
		|			ИЗ
		|				ВТ_СтрокиДляПоискаКорневогоОбъекта КАК ВТ_СтрокиДляПоискаКорневогоОбъекта)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии,
		|	СпрКлассы.КлассТабличнаяЧасть,
		|	ИСТИНА,
		|	ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса,
		|	ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиДляОбработки.Порядок
		|ИЗ
		|	ВТ_СтрокиСХвостами КАК ВТ_СтрокиСХвостами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|		ПО ВТ_СтрокиСХвостами.Объект = МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса
		|			И (ВТ_СтрокиСХвостами.СтрокаВложеннойТЧ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтрокиСХвостами КАК ВТ_НайденныеРодители
		|		ПО ВТ_СтрокиСХвостами.Объект = ВТ_НайденныеРодители.ЗначениеАтрибутаКласса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДляПоискаВИерархии КАК ВТ_ДанныеДляПоискаВИерархии
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|			ПО ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_СтрокиДляОбработки.Класс
		|				И ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса = ВТ_СтрокиДляОбработки.АтрибутКласса
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассы
		|			ПО ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = СпрКлассы.Ссылка
		|		ПО ВТ_СтрокиСХвостами.Объект = ВТ_ДанныеДляПоискаВИерархии.Класс
		|			И ВТ_СтрокиСХвостами.АтрибутКласса = ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса
		|			И ВТ_СтрокиСХвостами.ЗначениеАтрибутаКласса = ВТ_ДанныеДляПоискаВИерархии.ЗначениеАтрибутаКласса
		|ГДЕ
		|	ВТ_НайденныеРодители.Объект ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СтрокиДляПоискаКорневогоОбъекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СтрокиСХвостами.Объект
		|ПОМЕСТИТЬ ВТ_СтрокиДляПоискаКорневогоОбъекта
		|ИЗ
		|	ВТ_СтрокиСХвостамиДобавить КАК ВТ_СтрокиСХвостами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтрокиСХвостами КАК ВТ_НайденныеРодители
		|		ПО ВТ_СтрокиСХвостами.Объект = ВТ_НайденныеРодители.ЗначениеАтрибутаКласса
		|ГДЕ
		|	ВТ_СтрокиСХвостами.СтрокаВложеннойТЧ
		|	И ВТ_НайденныеРодители.Объект ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиСХвостами.Объект,
		|	ВТ_СтрокиСХвостами.СтрокаВложеннойТЧ,
		|	ВТ_СтрокиСХвостами.ОбъектЭтоКласс,
		|	ВТ_СтрокиСХвостами.АтрибутКласса,
		|	ВТ_СтрокиСХвостами.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиСХвостами.Порядок,
		|	ВТ_СтрокиСХвостами.ЕстьСтрокиДляВосстановления,
		|	ВТ_СтрокиСХвостами.ВидОшибки,
		|	ВТ_СтрокиСХвостами.ПредставлениеОшибки
		|ПОМЕСТИТЬ ВТ_СтрокиСХвостамиОбъединение
		|ИЗ
		|	ВТ_СтрокиСХвостами КАК ВТ_СтрокиСХвостами
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СтрокиСХвостамиДобавить.Объект,
		|	ВТ_СтрокиСХвостамиДобавить.СтрокаВложеннойТЧ,
		|	ВТ_СтрокиСХвостамиДобавить.ОбъектЭтоКласс,
		|	ВТ_СтрокиСХвостамиДобавить.АтрибутКласса,
		|	ВТ_СтрокиСХвостамиДобавить.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиСХвостамиДобавить.Порядок,
		|	ЛОЖЬ,
		|	0,
		|	""""
		|ИЗ
		|	ВТ_СтрокиСХвостамиДобавить КАК ВТ_СтрокиСХвостамиДобавить
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СтрокиСХвостами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СтрокиСХвостамиДобавить
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиСХвостамиОбъединение.Объект,
		|	ВТ_СтрокиСХвостамиОбъединение.СтрокаВложеннойТЧ,
		|	ВТ_СтрокиСХвостамиОбъединение.ОбъектЭтоКласс,
		|	ВТ_СтрокиСХвостамиОбъединение.АтрибутКласса,
		|	ВТ_СтрокиСХвостамиОбъединение.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиСХвостамиОбъединение.Порядок,
		|	ВТ_СтрокиСХвостамиОбъединение.ЕстьСтрокиДляВосстановления,
		|	ВТ_СтрокиСХвостамиОбъединение.ВидОшибки,
		|	ВТ_СтрокиСХвостамиОбъединение.ПредставлениеОшибки
		|ПОМЕСТИТЬ ВТ_СтрокиСХвостами
		|ИЗ
		|	ВТ_СтрокиСХвостамиОбъединение КАК ВТ_СтрокиСХвостамиОбъединение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СтрокиСХвостамиОбъединение";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТектЗапросаТаблицаРодителей()
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ВТ_СтрокиДляПоискаКорневогоОбъекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Классы.Ссылка КАК КлассДляЧтения,
		|	Классы.Ссылка КАК Класс
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_СтрокиСХвостами.Объект
		|			ИЗ
		|				ВТ_СтрокиСХвостами КАК ВТ_СтрокиСХвостами
		|			ГДЕ
		|				ВТ_СтрокиСХвостами.ОбъектЭтоКласс
		|				И НЕ ВТ_СтрокиСХвостами.СтрокаВложеннойТЧ
		|		
		|			ОБЪЕДИНИТЬ
		|		
		|			ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				НоменклатураКласса.Класс
		|			ИЗ
		|				Справочник.НоменклатураКласса КАК НоменклатураКласса
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиСХвостами КАК ВТ_СтрокиСХвостами
		|					ПО
		|						НоменклатураКласса.Ссылка = ВТ_СтрокиСХвостами.Объект
		|							И НЕ ВТ_СтрокиСХвостами.ОбъектЭтоКласс
		|							И НЕ ВТ_СтрокиСХвостами.СтрокаВложеннойТЧ)
		|ИТОГИ
		|	МАКСИМУМ(КлассДляЧтения)
		|ПО
		|	Класс,
		|	Класс ИЕРАРХИЯ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТектЗапросаДанныеДляПостроенияДерева()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаРодителей.КлассДляЧтения,
		|	ТаблицаРодителей.Класс,
		|	ТаблицаРодителей.Уровень
		|ПОМЕСТИТЬ ВТ_ТаблицаРодителей
		|ИЗ
		|	&ТаблицаРодителей КАК ТаблицаРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаРодителей.Класс) КАК Класс,
		|	ВТ_ТаблицаРодителей.Уровень
		|ПОМЕСТИТЬ ВТ_Ветвления
		|ИЗ
		|	ВТ_ТаблицаРодителей КАК ВТ_ТаблицаРодителей
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТаблицаРодителей.Уровень
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаРодителей.Класс) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТ_Ветвления.Уровень) КАК Уровень
		|ПОМЕСТИТЬ ВТ_МинУровень
		|ИЗ
		|	ВТ_Ветвления КАК ВТ_Ветвления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаРодителей.Уровень КАК Уровень,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_МинУровень.Уровень, 0) < ВТ_ТаблицаРодителей.Уровень
		|			ТОГДА Классы.Родитель
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Классы.ПустаяСсылка)
		|	КОНЕЦ КАК Родитель,
		|	ВТ_ТаблицаРодителей.Класс,
		|	Классы.Код
		|ИЗ
		|	ВТ_ТаблицаРодителей КАК ВТ_ТаблицаРодителей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МинУровень КАК ВТ_МинУровень
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Классы КАК Классы
		|		ПО ВТ_ТаблицаРодителей.Класс = Классы.Ссылка
		|ГДЕ
		|	ВТ_ТаблицаРодителей.Уровень >= ЕСТЬNULL(ВТ_МинУровень.Уровень, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Уровень";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТектЗапросаНоменклатураДляДобавленияВДерево()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка КАК Объект,
		|	НоменклатураКласса.Класс КАК Родитель,
		|	НоменклатураКласса.Код
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НоменклатураКласса.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_СтрокиСХвостами.Объект
		|			ИЗ
		|				ВТ_СтрокиСХвостами КАК ВТ_СтрокиСХвостами
		|			ГДЕ
		|				НЕ ВТ_СтрокиСХвостами.ОбъектЭтоКласс
		|				И НЕ ВТ_СтрокиСХвостами.СтрокаВложеннойТЧ)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТектЗапросаВыборСтрокТЧДляДобавления()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СтрокиСХвостами.Объект,
		|	ВТ_СтрокиСХвостами.АтрибутКласса,
		|	ВТ_СтрокиСХвостами.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиСХвостами.Порядок,
		|	ВТ_СтрокиСХвостами.ЕстьСтрокиДляВосстановления,
		|	ВТ_СтрокиСХвостами.ВидОшибки,
		|	ВТ_СтрокиСХвостами.ПредставлениеОшибки
		|ПОМЕСТИТЬ ВТ_СтрокиДляДобавления
		|ИЗ
		|	ВТ_СтрокиСХвостами КАК ВТ_СтрокиСХвостами
		|ГДЕ
		|	НЕ ВТ_СтрокиСХвостами.СтрокаВложеннойТЧ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТектЗапросаВыборПодстрокДляДобавления()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_СтрокиДляДобавления.Объект,
		|	ВТ_СтрокиДляДобавления.АтрибутКласса,
		|	ВТ_СтрокиДляДобавления.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиДляДобавления.Порядок КАК Порядок,
		|	ЕСТЬNULL(Классы.Код, СпрНоменклатураКласса.Код) КАК Код,
		|	ЕСТЬNULL(СпрНоменклатураКласса.Класс, Классы.Родитель) КАК Родитель,
		|	ВТ_СтрокиДляДобавления.ЕстьСтрокиДляВосстановления,
		|	ВТ_СтрокиДляДобавления.ВидОшибки,
		|	ВТ_СтрокиДляДобавления.ПредставлениеОшибки
		|ИЗ
		|	ВТ_СтрокиДляДобавления КАК ВТ_СтрокиДляДобавления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКласса КАК СпрНоменклатураКласса
		|		ПО ВТ_СтрокиДляДобавления.ЗначениеАтрибутаКласса = СпрНоменклатураКласса.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Классы КАК Классы
		|		ПО ВТ_СтрокиДляДобавления.ЗначениеАтрибутаКласса = Классы.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиСХвостами.Объект,
		|	ВТ_СтрокиСХвостами.АтрибутКласса,
		|	ВТ_СтрокиСХвостами.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиСХвостами.Порядок,
		|	ВТ_СтрокиСХвостами.ЕстьСтрокиДляВосстановления,
		|	ВТ_СтрокиСХвостами.ВидОшибки,
		|	ВТ_СтрокиСХвостами.ПредставлениеОшибки
		|ПОМЕСТИТЬ ВТ_СтрокиДляДобавленияНовые
		|ИЗ
		|	ВТ_СтрокиСХвостами КАК ВТ_СтрокиСХвостами
		|ГДЕ
		|	ВТ_СтрокиСХвостами.Объект В
		|			(ВЫБРАТЬ
		|				ВТ_СтрокиДляДобавления.ЗначениеАтрибутаКласса
		|			ИЗ
		|				ВТ_СтрокиДляДобавления КАК ВТ_СтрокиДляДобавления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СтрокиДляДобавления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиДляДобавленияНовые.Объект,
		|	ВТ_СтрокиДляДобавленияНовые.АтрибутКласса,
		|	ВТ_СтрокиДляДобавленияНовые.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиДляДобавленияНовые.Порядок,
		|	ВТ_СтрокиДляДобавленияНовые.ЕстьСтрокиДляВосстановления,
		|	ВТ_СтрокиДляДобавленияНовые.ВидОшибки,
		|	ВТ_СтрокиДляДобавленияНовые.ПредставлениеОшибки
		|ПОМЕСТИТЬ ВТ_СтрокиДляДобавления
		|ИЗ
		|	ВТ_СтрокиДляДобавленияНовые КАК ВТ_СтрокиДляДобавленияНовые
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СтрокиДляДобавленияНовые";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьТаблицуРодителей(ТаблицаРодителей)
	
	ТаблицаРодителей.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	
	ТекКлассДляЧтения = Неопределено;
	Для Каждого СтрокаТЗ ИЗ ТаблицаРодителей Цикл
		Если НЕ СтрокаТЗ.КлассДляЧтения = ТекКлассДляЧтения Тогда
			М = 0;
			ТекКлассДляЧтения = СтрокаТЗ.КлассДляЧтения;
			ПредКласс = Неопределено;
		КонецЕсли;
		Если НЕ ПредКласс = СтрокаТЗ.Класс Тогда // Не заполняем уровень у дублирующихся строк.
			СтрокаТЗ.Уровень = М;
			Если М > 0 Тогда
				ПредКласс = СтрокаТЗ.Класс;
			КонецЕсли;
			М = М + 1;
		КонецЕсли;
	КонецЦикла;
	
	НайденоУдалить = ТаблицаРодителей.НайтиСтроки(Новый Структура("Уровень", 0));
	Для Каждого СтрокаТЗ ИЗ НайденоУдалить Цикл
		ТаблицаРодителей.Удалить(СтрокаТЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоКлассов(ВыборкаКлассов, СоответствиеЭлементовДерева)
	
	ЭлементыКорневые = ОбъектыДляВосстановления.ПолучитьЭлементы();
	ЭлементыКорневые.Очистить();
	
	Пока ВыборкаКлассов.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаКлассов.Родитель) Тогда
			КоллекцияЭлементов = ЭлементыКорневые;
		Иначе
			СтруктураСтроки = СоответствиеЭлементовДерева[ВыборкаКлассов.Родитель];
			Если СтруктураСтроки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			КоллекцияЭлементов = СтруктураСтроки.СтрокаДерева.ПолучитьЭлементы();
		КонецЕсли;
		
		СтрокаДерева = КоллекцияЭлементов.Добавить();
		СтрокаДерева.Объект = ВыборкаКлассов.Класс;
		СтрокаДерева.Код    = ВыборкаКлассов.Код;
		СтрокаДерева.ИндексКартинки = 1;
		//СтрокаДерева.Выбрано = Истина;
		
		СоответствиеЭлементовДерева.Вставить(ВыборкаКлассов.Класс, Новый Структура("СтрокаДерева", СтрокаДерева));
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьВДеревоЭлементыВыборки(ВыборкаЭлементов, СоответствиеЭлементовДерева)
	
	Пока ВыборкаЭлементов.Следующий() Цикл
		
		СтруктураСтроки = СоответствиеЭлементовДерева[ВыборкаЭлементов.Родитель];
		Если СтруктураСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КоллекцияЭлементов = СтруктураСтроки.СтрокаДерева.ПолучитьЭлементы();
		
		СтрокаДерева = КоллекцияЭлементов.Добавить();
		СтрокаДерева.Объект = ВыборкаЭлементов.Объект;
		СтрокаДерева.Код    = ВыборкаЭлементов.Код;
		СтрокаДерева.ИндексКартинки = 1;
		//СтрокаДерева.Выбрано = Истина;
		
		СоответствиеЭлементовДерева.Вставить(ВыборкаЭлементов.Объект, Новый Структура("СтрокаДерева", СтрокаДерева));
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьВДеревоСтрокиТЧ(ВыборкаСтрокиДляДобавления, СоответствиеЭлементовДерева, СтрокиТЧ)
	
	Пока ВыборкаСтрокиДляДобавления.Следующий() Цикл
		
		СтруктураСтроки = СоответствиеЭлементовДерева[ВыборкаСтрокиДляДобавления.Объект];
		Если СтруктураСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТабЧасти = Неопределено;
		Если НЕ СтруктураСтроки.Свойство("ТабЧасти", ТабЧасти) Тогда
			ТабЧасти = Новый Соответствие;
			СтруктураСтроки.Вставить("ТабЧасти", ТабЧасти);
		КонецЕсли;
		
		СтрокаТабЧасти = ТабЧасти[ВыборкаСтрокиДляДобавления.АтрибутКласса];
		Если СтрокаТабЧасти = Неопределено Тогда
			КоллекцияЭлементов = СтруктураСтроки.СтрокаДерева.ПолучитьЭлементы();
			СтрокаТабЧасти = КоллекцияЭлементов.Вставить(ТабЧасти.Количество());
			СтрокаТабЧасти.Объект  = ВыборкаСтрокиДляДобавления.АтрибутКласса;
			//СтрокаТабЧасти.Выбрано = Истина;
			
			ТабЧасти.Вставить(ВыборкаСтрокиДляДобавления.АтрибутКласса, СтрокаТабЧасти);
		КонецЕсли;
		
		КоллекцияЭлементов = СтрокаТабЧасти.ПолучитьЭлементы();
		СтрокаДерева = КоллекцияЭлементов.Добавить();
		СтрокаДерева.Объект          = ВыборкаСтрокиДляДобавления.ЗначениеАтрибутаКласса;
		СтрокаДерева.Код             = ВыборкаСтрокиДляДобавления.Код;
		СтрокаДерева.РодительТекущий = ВыборкаСтрокиДляДобавления.Родитель;
		СтрокаДерева.ИндексКартинки = 2;
		СтрокаДерева.ЕстьСтрокиДляВосстановления = ВыборкаСтрокиДляДобавления.ЕстьСтрокиДляВосстановления;
		СтрокаДерева.ВидОшибки                   = ВыборкаСтрокиДляДобавления.ВидОшибки;
		СтрокаДерева.ПредставлениеОшибки         = ВыборкаСтрокиДляДобавления.ПредставлениеОшибки;
		
		СоответствиеЭлементовДерева.Вставить(ВыборкаСтрокиДляДобавления.ЗначениеАтрибутаКласса, 
			Новый Структура("СтрокаДерева", СтрокаДерева));
		СтрокиТЧ.Добавить(ВыборкаСтрокиДляДобавления.ЗначениеАтрибутаКласса);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьПоискСтрокДляВосстановления(СтрокиТЧ, СоответствиеЭлементовДерева)
	
	Для Каждого СтрокаТЧ ИЗ СтрокиТЧ Цикл
		СтруктураСтроки = СоответствиеЭлементовДерева[СтрокаТЧ];
		Если СтруктураСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабЧасти = СтруктураСтроки.СтрокаДерева.ПолучитьРодителя();
		СтрокаОбъекта  = СтрокаТабЧасти.ПолучитьРодителя();
		
		// Ищем в таб.частях-родителях строку, в которой определена наследуемая строка.
		
		СтэкРодителей = Новый Массив;
		НайденРодительСтроки = НайтиРодителяСтроки(СтруктураСтроки, СтрокаОбъекта, СтрокаТабЧасти, 
			СоответствиеЭлементовДерева, СтэкРодителей);
		
		// Проходим по иерархии наследования, чтобы проследить, цела ли цепочка наследования?
		
		Если НайденРодительСтроки Тогда
			СтруктураСтроки.СтрокаДерева.ИндексКартинки = 3;
			ПроверитьИерархиюНаследованияСтроки(СтруктураСтроки, СтрокаТабЧасти, СтэкРодителей);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиРодителяСтроки(СтруктураСтроки, СтрокаОбъекта, СтрокаТабЧасти, СоответствиеЭлементовДерева, СтэкРодителей)
	
	СтруктураСтрокиРодителяОбъекта = ПолучитьСтруктуруРодителя(СтрокаОбъекта, СоответствиеЭлементовДерева);
	НайденРодительСтроки = Ложь;
	
	Пока НЕ НайденРодительСтроки И НЕ СтруктураСтрокиРодителяОбъекта = Неопределено Цикл
		СтэкРодителей.Добавить(СтруктураСтрокиРодителяОбъекта);
		ТабЧасти = Неопределено;
		Если СтруктураСтрокиРодителяОбъекта.Свойство("ТабЧасти", ТабЧасти) Тогда
			СтрокаТабЧастиРодителя = ТабЧасти[СтрокаТабЧасти.Объект];
			Если НЕ СтрокаТабЧастиРодителя = Неопределено Тогда
				ЭлементыТабЧасти = СтрокаТабЧастиРодителя.ПолучитьЭлементы();
				Для Каждого СтрокаТЧРодителя ИЗ ЭлементыТабЧасти Цикл
					Если СтрокаТЧРодителя.Объект = СтруктураСтроки.СтрокаДерева.РодительТекущий Тогда
						НайденРодительСтроки = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ НайденРодительСтроки Тогда
			СтруктураСтрокиРодителяОбъекта = ПолучитьСтруктуруРодителя(
				СтруктураСтрокиРодителяОбъекта.СтрокаДерева, СоответствиеЭлементовДерева);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденРодительСтроки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруРодителя(СтрокаОбъекта, СоответствиеЭлементовДерева)
	
	Если СтрокаОбъекта.ИндексКартинки >= 2 Тогда
		СтруктураСтрокиРодителяОбъекта = СоответствиеЭлементовДерева[СтрокаОбъекта.РодительТекущий];
	Иначе
		СтрокаРодителяОбъекта = СтрокаОбъекта.ПолучитьРодителя();
		Если НЕ СтрокаРодителяОбъекта = Неопределено Тогда 
			СтруктураСтрокиРодителяОбъекта = СоответствиеЭлементовДерева[СтрокаРодителяОбъекта.Объект];
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураСтрокиРодителяОбъекта;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПроверитьИерархиюНаследованияСтроки(СтруктураСтроки, СтрокаТабЧасти, СтэкРодителей)
	
	РодительДляЗамены = СтруктураСтроки.СтрокаДерева.РодительТекущий;
	
	КолВо = СтэкРодителей.Количество();
	Для Н = 1 По КолВо-1 Цикл
		
		СтруктураСтрокиРодителяОбъекта = СтэкРодителей[КолВо-Н-1];
		ТабЧасти = Неопределено;
		Если СтруктураСтрокиРодителяОбъекта.Свойство("ТабЧасти", ТабЧасти) Тогда
			СтрокаТабЧастиРодителя = ТабЧасти[СтрокаТабЧасти.Объект];
			Если НЕ СтрокаТабЧастиРодителя = Неопределено Тогда
				ЭлементыТабЧасти = СтрокаТабЧастиРодителя.ПолучитьЭлементы();
				Для Каждого СтрокаТЧРодителя ИЗ ЭлементыТабЧасти Цикл
					Если СтрокаТЧРодителя.РодительТекущий = РодительДляЗамены Тогда
						РодительДляЗамены = СтрокаТЧРодителя.Объект;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ РодительДляЗамены = СтруктураСтроки.СтрокаДерева.РодительТекущий Тогда
		СтруктураСтроки.СтрокаДерева.ЕстьСтрокиДляВосстановления = Истина;
		СтруктураСтроки.СтрокаДерева.РодительУстановить = РодительДляЗамены;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПоискДублейСтрок

&НаСервере
Процедура НайтиСтрокиДублиНаСервере()

	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	// 1. Все объекты, у которых есть строки таб.частей.
	Запрос.Текст = ТектЗапросаВсеСтрокиТЧ();
	Результаты = Запрос.ВыполнитьПакет();
	
	МассивОбъектов = Результаты[2].Выгрузить().ВыгрузитьКолонку("Объект");
	
	// 2. Получение строк-дублей.
	Справочники.Классы.ПолучитьДублиСтрок(МассивОбъектов, МенеджерВТ);
	
	Запрос.Текст = ТекстЗапросаВыборДублейСтрок();
	Результаты = Запрос.ВыполнитьПакет();
	
	// 3. Поиск недостающих строк для построения иерархии (если на этапе 2 найдены строки вложенных таб.частей).
	Запрос.Текст = ТектЗапросаОбходСтрокВложенныхТабЧастей();
	
	ВыборкаСтрокиДляПоискаКорневогоОбъекта = Результаты[Результаты.ВГраница()].Выбрать();
	Пока ВыборкаСтрокиДляПоискаКорневогоОбъекта.Следующий() И ВыборкаСтрокиДляПоискаКорневогоОбъекта.Количество > 0 Цикл
		Результаты = Запрос.ВыполнитьПакет();
		ВыборкаСтрокиДляПоискаКорневогоОбъекта = Результаты[2].Выбрать();
	КонецЦикла;
	
	// 4. Таблица классов-родителей для построения иерархии объектов-владельцев таб.частей.
	Запрос.Текст = ТектЗапросаТаблицаРодителей();
	
	ТаблицаРодителей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ОбработатьТаблицуРодителей(ТаблицаРодителей);
	
	// 5. Таблица иерархии классов с отбором по первому уровню ветвления 
	//    (отброс уровней иерархии, в которых только один вложенный элемент).
	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителей);
	Запрос.Текст = ТектЗапросаДанныеДляПостроенияДерева();
	
	Результат = Запрос.Выполнить().Выбрать();
	
	СоответствиеЭлементовДерева = Новый Соответствие;
	СформироватьДеревоКлассов(Результат, СоответствиеЭлементовДерева);
	
	// 6. Таблица номенклатуры для добавления в дерево классов.
	Запрос.Текст = ТектЗапросаНоменклатураДляДобавленияВДерево();
	
	Результат = Запрос.Выполнить().Выбрать();
	ДобавитьВДеревоЭлементыВыборки(Результат, СоответствиеЭлементовДерева);
	
	// 7. Добавление таб.частей и строк в дерево.
	Запрос.Текст = ТектЗапросаВыборСтрокТЧДляДобавления();
	ВыборкаВТСтрокиДляДобавления = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст = ТектЗапросаВыборПодстрокДляДобавления();
	
	СтрокиТЧ = Новый Массив;
	
	Пока ВыборкаВТСтрокиДляДобавления.Следующий() И ВыборкаВТСтрокиДляДобавления.Количество > 0 Цикл
		
		Результаты = Запрос.ВыполнитьПакет();
		ВыборкаСтрокиДляДобавления = Результаты[0].Выбрать();
		ДобавитьВДеревоСтрокиТЧ(ВыборкаСтрокиДляДобавления, СоответствиеЭлементовДерева, СтрокиТЧ);
		
		ВыборкаВТСтрокиДляДобавления = Результаты[3].Выбрать();
	КонецЦикла;
	
КонецПроцедуры // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

&НаСервереБезКонтекста
Функция ТекстЗапросаВыборДублейСтрок()
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ДублиСтрок.Класс КАК Объект,
		|	ЕСТЬNULL(СпрКлассы.КлассТабличнаяЧасть, СпрНоменклатураКласса.Класс.КлассТабличнаяЧасть) КАК СтрокаВложеннойТЧ,
		|	ВЫБОР
		|		КОГДА НЕ СпрКлассы.Ссылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОбъектЭтоКласс,
		|	ВТ_ДублиСтрок.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ДублиСтрок.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВТ_ДублиСтрок.Порядок КАК Порядок,
		|	ИСТИНА КАК ЕстьСтрокиДляВосстановления,
		|	2 КАК ВидОшибки,
		|	""Дублирующаяся строка"" КАК ПредставлениеОшибки
		|ПОМЕСТИТЬ ВТ_СтрокиСХвостами
		|ИЗ
		|	ВТ_ДублиСтрок КАК ВТ_ДублиСтрок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКласса КАК СпрНоменклатураКласса
		|		ПО ВТ_ДублиСтрок.Класс = СпрНоменклатураКласса.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассы
		|		ПО ВТ_ДублиСтрок.Класс = СпрКлассы.Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии,
		|	СпрКлассы.КлассТабличнаяЧасть,
		|	ИСТИНА,
		|	ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса,
		|	ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиДляОбработки.Порядок,
		|	ЛОЖЬ,
		|	0,
		|	""""
		|ИЗ
		|	ВТ_ДублиСтрок КАК ВТ_ДублиСтрок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДляПоискаВИерархии КАК ВТ_ДанныеДляПоискаВИерархии
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|			ПО ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_СтрокиДляОбработки.Класс
		|				И ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса = ВТ_СтрокиДляОбработки.АтрибутКласса
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассы
		|			ПО ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = СпрКлассы.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДублиСтрок КАК ВТ_НайденныеДубли
		|			ПО ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_НайденныеДубли.ЗначениеАтрибутаКласса
		|		ПО ВТ_ДублиСтрок.Класс = ВТ_ДанныеДляПоискаВИерархии.Класс
		|			И ВТ_ДублиСтрок.АтрибутКласса = ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса
		|			И ВТ_ДублиСтрок.ЗначениеАтрибутаКласса = ВТ_ДанныеДляПоискаВИерархии.ЗначениеАтрибутаКласса
		|ГДЕ 
		|	(НЕ СпрКлассы.КлассТабличнаяЧасть ИЛИ НЕ ВТ_НайденныеДубли.ЗначениеАтрибутаКласса ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СтрокиСХвостами.Объект
		|ПОМЕСТИТЬ ВТ_СтрокиДляПоискаКорневогоОбъекта
		|ИЗ
		|	ВТ_СтрокиСХвостами КАК ВТ_СтрокиСХвостами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтрокиСХвостами КАК ВТ_НайденныеРодители
		|		ПО ВТ_СтрокиСХвостами.Объект = ВТ_НайденныеРодители.ЗначениеАтрибутаКласса
		|ГДЕ
		|	ВТ_СтрокиСХвостами.СтрокаВложеннойТЧ
		|	И ВТ_НайденныеРодители.Объект ЕСТЬ NULL";
	
	Возврат ТекстЗапроса;
	
КонецФункции // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

#КонецОбласти

#Область ВосстановлениеНаследованияСтрокТЧ

&НаСервере
Процедура ВосстановитьНаследованиеСтрокТЧНаСервере()
	
	ДеревоПоиска = РеквизитФормыВЗначение("ОбъектыДляВосстановления");
	
	СтруктураПоиска = Новый Структура("Выбрано, ЕстьСтрокиДляВосстановления, ВидОшибки", Истина, Истина, 1);
	НайденоСтрокиДляВосстановления = ДеревоПоиска.Строки.НайтиСтроки(СтруктураПоиска, Истина);
	
	ТипНоменклатура = Тип("СправочникСсылка.НоменклатураКласса");
	ТипКласс = Тип("СправочникСсылка.Классы");
	
	МассивОбъектовДляПоискаВложенных = Новый Массив;
	Отказ = Ложь;
	
	Для Каждого СтрокаНайдено Из НайденоСтрокиДляВосстановления Цикл
		
		ТипОбъекта = ТипЗнч(СтрокаНайдено.Объект);
		Если НЕ ТипОбъекта = ТипНоменклатура И НЕ ТипОбъекта = ТипКласс Тогда
			Продолжить;
		КонецЕсли;
		
		СпрОбъект = СтрокаНайдено.Объект.ПолучитьОбъект();
		Если ТипОбъекта = ТипНоменклатура Тогда
			СпрОбъект.Класс = СтрокаНайдено.РодительУстановить;
		ИначеЕсли ТипОбъекта = ТипКласс Тогда
			СпрОбъект.Родитель = СтрокаНайдено.РодительУстановить;
		КонецЕсли;
		
		Попытка
			СпрОбъект.Записать();
			МассивОбъектовДляПоискаВложенных.Добавить(СтрокаНайдено.Объект);
		Исключение
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Ошибка при записи элемента %1: 
					|%2.'"), СтрокаНайдено.Объект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			Прервать;
		КонецПопытки;
		
		СтрокаНайдено.Выбрано = Ложь;
		СтрокаНайдено.ЕстьСтрокиДляВосстановления = Ложь;
		СтрокаНайдено.РодительТекущий = СтрокаНайдено.РодительУстановить;
		СтрокаНайдено.РодительУстановить = Справочники.Классы.ПустаяСсылка();
		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		Справочники.Классы.ВосстановитьНаследованиеТабЧастей(МассивОбъектовДляПоискаВложенных);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоПоиска, "ОбъектыДляВосстановления");
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДублиСтрокНаСервере()
	
	
	ДеревоПоиска = РеквизитФормыВЗначение("ОбъектыДляВосстановления");
	
	СтруктураПоиска = Новый Структура("Выбрано, ЕстьСтрокиДляВосстановления, ВидОшибки", Истина, Истина, 2);
	НайденоСтрокиДляУдаления = ДеревоПоиска.Строки.НайтиСтроки(СтруктураПоиска, Истина);
	
	ТипНоменклатура = Тип("СправочникСсылка.НоменклатураКласса");
	ТипКласс = Тип("СправочникСсылка.Классы");
	
	СтрокиПропустить = Новый Массив;
	СтрокиУдалить = Новый Массив;
	
	Для Каждого СтрокаНайдено Из НайденоСтрокиДляУдаления Цикл
		Если НЕ СтрокиПропустить.Найти(СтрокаНайдено) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипОбъекта = ТипЗнч(СтрокаНайдено.Объект);
		Если НЕ ТипОбъекта = ТипНоменклатура И НЕ ТипОбъекта = ТипКласс Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабЧасти = СтрокаНайдено.Родитель;
		СтрокаОбъекта = СтрокаТабЧасти.Родитель;
		
		Запись = РегистрыСведений.МножественныеЗначенияАтрибутов.СоздатьМенеджерЗаписи();
		Запись.Класс                  = СтрокаОбъекта.Объект;
		Запись.АтрибутКласса          = СтрокаТабЧасти.Объект;
		Запись.ЗначениеАтрибутаКласса = СтрокаНайдено.Объект;
		
		Попытка
			Запись.Удалить();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Ошибка при удалении элемента %1: 
					|%2.'"), СтрокаНайдено.Объект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			Прервать;
		КонецПопытки;
		
		ВложенныеСтроки = СтрокаНайдено.Строки.НайтиСтроки(СтруктураПоиска);
		Для Каждого ВложеннаяСтрока ИЗ ВложенныеСтроки Цикл
			СтрокиПропустить.Добавить(ВложеннаяСтрока);
		КонецЦикла;
		
		СтрокиУдалить.Добавить(СтрокаНайдено);
		
	КонецЦикла;
	
	Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
		СтрокаРодитель = СтрокаУдалить.Родитель;
		СтрокаРодитель.Строки.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоПоиска, "ОбъектыДляВосстановления");
	
КонецПроцедуры // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

&НаСервере
Процедура ВывестиПодчиненныеОбъектыНаСервере()
	
	ИДСтроки = Элементы.ОбъектыДляВосстановления.ТекущаяСтрока;
	Если ИДСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = ОбъектыДляВосстановления.НайтиПоИдентификатору(ИДСтроки);
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипНоменклатура = Тип("СправочникСсылка.НоменклатураКласса");
	ТипКласс = Тип("СправочникСсылка.Классы");
	
	ТипОбъекта = ТипЗнч(ТекСтрока.Объект);
	Если НЕ ТипОбъекта = ТипНоменклатура И НЕ ТипОбъекта = ТипКласс Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеОбъектовИСтрок = Новый Соответствие;
	
	КоллекцияЭлементов = ТекСтрока.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из КоллекцияЭлементов Цикл
		СоответствиеОбъектовИСтрок.Вставить(СтрокаТЧ.Объект, СтрокаТЧ);
		КоллекцияВложенных = СтрокаТЧ.ПолучитьЭлементы();
		Для Каждого СтрокаВложенная ИЗ КоллекцияВложенных Цикл 
			СоответствиеОбъектовИСтрок.Вставить(СтрокаВложенная.Объект, СтрокаВложенная);
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПодчиненныеОбъекты();
	
	Запрос.УстановитьПараметр("Класс", ТекСтрока.Объект);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		СтрокаДерева = СоответствиеОбъектовИСтрок[Результат.ЗначениеАтрибутаКласса];
		Если НЕ СтрокаДерева = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = СоответствиеОбъектовИСтрок[Результат.АтрибутКласса];
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = КоллекцияЭлементов.Добавить();
			СтрокаТЧ.Объект = Результат.АтрибутКласса;
			СоответствиеОбъектовИСтрок.Вставить(Результат.АтрибутКласса, СтрокаТЧ);
		КонецЕсли;
		
		КоллекцияВложенных = СтрокаТЧ.ПолучитьЭлементы();
		
		СтрокаДерева = КоллекцияВложенных.Добавить();
		СтрокаДерева.Объект          = Результат.ЗначениеАтрибутаКласса;
		СтрокаДерева.Код             = Результат.Код;
		СтрокаДерева.РодительТекущий = Результат.Родитель;
		СтрокаДерева.ИндексКартинки  = 2;
		
		СтрокаДерева.ЕстьСтрокиДляВосстановления = Ложь;
		СтрокаДерева.ВидОшибки                   = 0;
		
	КонецЦикла;
	
КонецПроцедуры // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

&НаСервереБезКонтекста
Функция ТекстЗапросаПодчиненныеОбъекты()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	МножественныеЗначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса,
		|	МножественныеЗначенияАтрибутов.Порядок КАК Порядок,
		|	ЕСТЬNULL(СпрКлассы.Код, СпрНоменклатураКласса.Код) КАК Код,
		|	ЕСТЬNULL(СпрКлассы.Родитель, СпрНоменклатураКласса.Класс) КАК Родитель
		|ИЗ
		|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассы
		|		ПО МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса = СпрКлассы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКласса КАК СпрНоменклатураКласса
		|		ПО МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса = СпрНоменклатураКласса.Ссылка
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.Класс = &Класс
		|	И МножественныеЗначенияАтрибутов.ТабличныйАтрибут
		|
		|УПОРЯДОЧИТЬ ПО
		|	АтрибутКласса,
		|	Порядок
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат ТекстЗапроса;
	
КонецФункции // } Гкс-[TOIR-1/00000090] Однодворцев И. от 18.06.2019.

#КонецОбласти

#КонецОбласти
